{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "5a7f1fe9-cd12-44f3-8e40-99c83671bb65",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Pretty printing has been turned OFF\n",
      "======== Neo4j/4.4.7 ========\n",
      "Utility libraries created in 14 seconds\n"
     ]
    }
   ],
   "source": [
    "\n",
    "%pprint\n",
    "%matplotlib inline\n",
    "import sys\n",
    "sys.path.insert(1, '../py')\n",
    "from jobpostlib import (crf, cu, datetime, duration, hau, hc, humanize, ihu, lru, nu, osp, scrfcu, slrcu, ssgdcu, su, t0, time, wsu, speech_engine)\n",
    "import os\n",
    "from pandas import DataFrame\n",
    "import re\n",
    "\n",
    "freq = 990"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "d123d4ef-5c58-4c2b-ad62-dab65246f2b4",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>file_name</th>\n",
       "      <th>left_navigable_parent</th>\n",
       "      <th>middle_navigable_parent</th>\n",
       "      <th>right_navigable_parent</th>\n",
       "      <th>job_title</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>3c2a56e15051e119_Training_and_placement_with_B...</td>\n",
       "      <td>2.</td>\n",
       "      <td>&lt;b&gt;Python Developer&lt;/b&gt;</td>\n",
       "      <td>None</td>\n",
       "      <td>Training and placement with BA QA remote Remote</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>77201e16ca4e59f7_Python_Developer_Los_Angeles_...</td>\n",
       "      <td>&lt;div&gt;\\n  4+ years of proven experience as a Py...</td>\n",
       "      <td>&lt;b&gt;Python Developer&lt;/b&gt;</td>\n",
       "      <td>None</td>\n",
       "      <td>Python Developer Los Angeles CA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>a750c4fced248190_Python_Developer_Maharashtra_...</td>\n",
       "      <td>- Maharashtra</td>\n",
       "      <td>&lt;b&gt;Python Developer&lt;/b&gt;</td>\n",
       "      <td>None</td>\n",
       "      <td>Python Developer Maharashtra Los Angeles CA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>8daead9543820e35_Senior_Software_Engineer_Pyth...</td>\n",
       "      <td>&lt;b&gt;Job Description:&lt;/b&gt;</td>\n",
       "      <td>&lt;b&gt;Python Developer&lt;/b&gt;</td>\n",
       "      <td>None</td>\n",
       "      <td>Senior Software Engineer Python Remote</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>65eff1bfff618e30_Sr_Python_Developer_Remote_In...</td>\n",
       "      <td>&lt;b&gt;Job Description:&lt;/b&gt;</td>\n",
       "      <td>&lt;b&gt;Python Developer&lt;/b&gt;</td>\n",
       "      <td>None</td>\n",
       "      <td>Sr Python Developer Remote</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>630</th>\n",
       "      <td>cf771117afc5276e_Assistant_Research_Professor_...</td>\n",
       "      <td>The Department of Biomedical Informatics at th...</td>\n",
       "      <td>&lt;i&gt;Assistant Research Professor Position, Onto...</td>\n",
       "      <td>None</td>\n",
       "      <td>Assistant Research Professor in and Curation A...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>631</th>\n",
       "      <td>5a11f57c84f46ede_Senior_Machine_Learning_Engin...</td>\n",
       "      <td>&lt;p&gt;#LI-REMOTE&lt;/p&gt;</td>\n",
       "      <td>&lt;p&gt; #LI-MidSenior&lt;/p&gt;</td>\n",
       "      <td>None</td>\n",
       "      <td>Senior Machine Learning Engineer Machine Learn...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>632</th>\n",
       "      <td>6b2b2944837c5137_Advanced_Data_Analyst_Remote_...</td>\n",
       "      <td>Job Title:</td>\n",
       "      <td>&lt;b&gt;Advanced Data Analyst &lt;/b&gt;</td>\n",
       "      <td>None</td>\n",
       "      <td>Advanced Data Analyst Remote</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>633</th>\n",
       "      <td>9901043347759693_Biostatistician_Remote_Indeed...</td>\n",
       "      <td>Regular</td>\n",
       "      <td>&lt;div&gt;\\n   Clearance Level Must Currently Posse...</td>\n",
       "      <td>None</td>\n",
       "      <td>9901043347759693 Remote</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>634</th>\n",
       "      <td>9b17c28f4135bf83_Data_Quality_Analyst_Windsor_...</td>\n",
       "      <td>Regular</td>\n",
       "      <td>&lt;div&gt;\\n   Clearance Level Must Currently Posse...</td>\n",
       "      <td>None</td>\n",
       "      <td>Data Quality Analyst Windsor Mill MD</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>635 rows × 5 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                             file_name  \\\n",
       "0    3c2a56e15051e119_Training_and_placement_with_B...   \n",
       "1    77201e16ca4e59f7_Python_Developer_Los_Angeles_...   \n",
       "2    a750c4fced248190_Python_Developer_Maharashtra_...   \n",
       "3    8daead9543820e35_Senior_Software_Engineer_Pyth...   \n",
       "4    65eff1bfff618e30_Sr_Python_Developer_Remote_In...   \n",
       "..                                                 ...   \n",
       "630  cf771117afc5276e_Assistant_Research_Professor_...   \n",
       "631  5a11f57c84f46ede_Senior_Machine_Learning_Engin...   \n",
       "632  6b2b2944837c5137_Advanced_Data_Analyst_Remote_...   \n",
       "633  9901043347759693_Biostatistician_Remote_Indeed...   \n",
       "634  9b17c28f4135bf83_Data_Quality_Analyst_Windsor_...   \n",
       "\n",
       "                                 left_navigable_parent  \\\n",
       "0                                                   2.   \n",
       "1    <div>\\n  4+ years of proven experience as a Py...   \n",
       "2                                        - Maharashtra   \n",
       "3                              <b>Job Description:</b>   \n",
       "4                              <b>Job Description:</b>   \n",
       "..                                                 ...   \n",
       "630  The Department of Biomedical Informatics at th...   \n",
       "631                                  <p>#LI-REMOTE</p>   \n",
       "632                                         Job Title:   \n",
       "633                                            Regular   \n",
       "634                                            Regular   \n",
       "\n",
       "                               middle_navigable_parent right_navigable_parent  \\\n",
       "0                              <b>Python Developer</b>                   None   \n",
       "1                              <b>Python Developer</b>                   None   \n",
       "2                              <b>Python Developer</b>                   None   \n",
       "3                              <b>Python Developer</b>                   None   \n",
       "4                              <b>Python Developer</b>                   None   \n",
       "..                                                 ...                    ...   \n",
       "630  <i>Assistant Research Professor Position, Onto...                   None   \n",
       "631                              <p> #LI-MidSenior</p>                   None   \n",
       "632                      <b>Advanced Data Analyst </b>                   None   \n",
       "633  <div>\\n   Clearance Level Must Currently Posse...                   None   \n",
       "634  <div>\\n   Clearance Level Must Currently Posse...                   None   \n",
       "\n",
       "                                             job_title  \n",
       "0      Training and placement with BA QA remote Remote  \n",
       "1                      Python Developer Los Angeles CA  \n",
       "2          Python Developer Maharashtra Los Angeles CA  \n",
       "3               Senior Software Engineer Python Remote  \n",
       "4                           Sr Python Developer Remote  \n",
       "..                                                 ...  \n",
       "630  Assistant Research Professor in and Curation A...  \n",
       "631  Senior Machine Learning Engineer Machine Learn...  \n",
       "632                       Advanced Data Analyst Remote  \n",
       "633                            9901043347759693 Remote  \n",
       "634               Data Quality Analyst Windsor Mill MD  \n",
       "\n",
       "[635 rows x 5 columns]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "\n",
    "cypher_str = \"\"\"\n",
    "    // Get the file names of HTML strings that are Job Titles\n",
    "    CALL {\n",
    "        MATCH (np1:NavigableParents)-[r:NEXT]->(np2:NavigableParents)\n",
    "        WHERE\n",
    "            ((np1.is_header = false) AND (np1.is_job_title = true))\n",
    "        RETURN\n",
    "            r.file_name AS file_name,\n",
    "            LEFT(np2.navigable_parent, 50) AS left_navigable_parent,\n",
    "            LEFT(np1.navigable_parent, 50) AS middle_navigable_parent,\n",
    "            NULL AS right_navigable_parent\n",
    "    UNION\n",
    "        MATCH (np2:NavigableParents)-[r:NEXT]->(np1:NavigableParents)\n",
    "        WHERE\n",
    "            ((np1.is_header = false) AND (np1.is_job_title = true))\n",
    "        RETURN\n",
    "            r.file_name AS file_name,\n",
    "            LEFT(np2.navigable_parent, 50) AS left_navigable_parent,\n",
    "            LEFT(np1.navigable_parent, 50) AS middle_navigable_parent,\n",
    "            NULL AS right_navigable_parent\n",
    "    }\n",
    "    RETURN file_name, left_navigable_parent, middle_navigable_parent, right_navigable_parent;\"\"\"\n",
    "row_objs_list = []\n",
    "with cu.driver.session() as session:\n",
    "        row_objs_list = session.write_transaction(cu.do_cypher_tx, cypher_str)\n",
    "if row_objs_list:\n",
    "    df = DataFrame(row_objs_list)\n",
    "    df['job_title'] = df.file_name.map(lambda file_name: su.get_job_title_from_file_name(file_name))\n",
    "    display(df)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "86f5758b-38dc-40c4-8519-7971099f9198",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "    // Set the is_job_title to false\n",
      "    MATCH (np:NavigableParents {navigable_parent: \"<div>\n",
      "   Clearance Level Must Currently Possess:\n",
      " \"})\n",
      "    SET np.is_job_title = false\n",
      "    RETURN\n",
      "        np.navigable_parent AS navigable_parent,\n",
      "        np.is_header AS is_header,\n",
      "        np.is_task_scope AS is_task_scope,\n",
      "        np.is_minimum_qualification AS is_minimum_qualification,\n",
      "        np.is_preferred_qualification AS is_preferred_qualification,\n",
      "        np.is_legal_notification AS is_legal_notification,\n",
      "        np.is_job_title AS is_job_title,\n",
      "        np.is_office_location AS is_office_location,\n",
      "        np.is_job_duration AS is_job_duration,\n",
      "        np.is_supplemental_pay AS is_supplemental_pay,\n",
      "        np.is_educational_requirement AS is_educational_requirement,\n",
      "        np.is_interview_procedure AS is_interview_procedure,\n",
      "        np.is_corporate_scope AS is_corporate_scope,\n",
      "        np.is_posting_date AS is_posting_date,\n",
      "        np.is_other AS is_other;\n",
      "\n",
      "    // Set the is_job_title to false\n",
      "    MATCH (np:NavigableParents {navigable_parent: \"<div>\n",
      "   Clearance Level Must Be Able to Obtain:\n",
      " \"})\n",
      "    SET np.is_job_title = false\n",
      "    RETURN\n",
      "        np.navigable_parent AS navigable_parent,\n",
      "        np.is_header AS is_header,\n",
      "        np.is_task_scope AS is_task_scope,\n",
      "        np.is_minimum_qualification AS is_minimum_qualification,\n",
      "        np.is_preferred_qualification AS is_preferred_qualification,\n",
      "        np.is_legal_notification AS is_legal_notification,\n",
      "        np.is_job_title AS is_job_title,\n",
      "        np.is_office_location AS is_office_location,\n",
      "        np.is_job_duration AS is_job_duration,\n",
      "        np.is_supplemental_pay AS is_supplemental_pay,\n",
      "        np.is_educational_requirement AS is_educational_requirement,\n",
      "        np.is_interview_procedure AS is_interview_procedure,\n",
      "        np.is_corporate_scope AS is_corporate_scope,\n",
      "        np.is_posting_date AS is_posting_date,\n",
      "        np.is_other AS is_other;\n",
      "\n",
      "    // Set the is_job_title to false\n",
      "    MATCH (np:NavigableParents {navigable_parent: \"<div>\n",
      "   Clearance Level Must Be Able to Obtain:\n",
      " \"})\n",
      "    SET np.is_job_title = false\n",
      "    RETURN\n",
      "        np.navigable_parent AS navigable_parent,\n",
      "        np.is_header AS is_header,\n",
      "        np.is_task_scope AS is_task_scope,\n",
      "        np.is_minimum_qualification AS is_minimum_qualification,\n",
      "        np.is_preferred_qualification AS is_preferred_qualification,\n",
      "        np.is_legal_notification AS is_legal_notification,\n",
      "        np.is_job_title AS is_job_title,\n",
      "        np.is_office_location AS is_office_location,\n",
      "        np.is_job_duration AS is_job_duration,\n",
      "        np.is_supplemental_pay AS is_supplemental_pay,\n",
      "        np.is_educational_requirement AS is_educational_requirement,\n",
      "        np.is_interview_procedure AS is_interview_procedure,\n",
      "        np.is_corporate_scope AS is_corporate_scope,\n",
      "        np.is_posting_date AS is_posting_date,\n",
      "        np.is_other AS is_other;\n",
      "\n",
      "    // Set the is_job_title to false\n",
      "    MATCH (np:NavigableParents {navigable_parent: \"<div>\n",
      "   Public Trust/Other Required:\n",
      " </div>\"})\n",
      "    SET np.is_job_title = false\n",
      "    RETURN\n",
      "        np.navigable_parent AS navigable_parent,\n",
      "        np.is_header AS is_header,\n",
      "        np.is_task_scope AS is_task_scope,\n",
      "        np.is_minimum_qualification AS is_minimum_qualification,\n",
      "        np.is_preferred_qualification AS is_preferred_qualification,\n",
      "        np.is_legal_notification AS is_legal_notification,\n",
      "        np.is_job_title AS is_job_title,\n",
      "        np.is_office_location AS is_office_location,\n",
      "        np.is_job_duration AS is_job_duration,\n",
      "        np.is_supplemental_pay AS is_supplemental_pay,\n",
      "        np.is_educational_requirement AS is_educational_requirement,\n",
      "        np.is_interview_procedure AS is_interview_procedure,\n",
      "        np.is_corporate_scope AS is_corporate_scope,\n",
      "        np.is_posting_date AS is_posting_date,\n",
      "        np.is_other AS is_other;\n",
      "\n",
      "    // Set the is_job_title to false\n",
      "    MATCH (np:NavigableParents {navigable_parent: \"<div>\n",
      "   Public Trust/Other Required:\n",
      " </div>\"})\n",
      "    SET np.is_job_title = false\n",
      "    RETURN\n",
      "        np.navigable_parent AS navigable_parent,\n",
      "        np.is_header AS is_header,\n",
      "        np.is_task_scope AS is_task_scope,\n",
      "        np.is_minimum_qualification AS is_minimum_qualification,\n",
      "        np.is_preferred_qualification AS is_preferred_qualification,\n",
      "        np.is_legal_notification AS is_legal_notification,\n",
      "        np.is_job_title AS is_job_title,\n",
      "        np.is_office_location AS is_office_location,\n",
      "        np.is_job_duration AS is_job_duration,\n",
      "        np.is_supplemental_pay AS is_supplemental_pay,\n",
      "        np.is_educational_requirement AS is_educational_requirement,\n",
      "        np.is_interview_procedure AS is_interview_procedure,\n",
      "        np.is_corporate_scope AS is_corporate_scope,\n",
      "        np.is_posting_date AS is_posting_date,\n",
      "        np.is_other AS is_other;\n"
     ]
    }
   ],
   "source": [
    "\n",
    "# mask_series = (df.char_count > 165)\n",
    "for child_str in df.iloc[637:642].middle_navigable_parent:\n",
    "    def do_cypher_tx(tx, navigable_parent):\n",
    "        cypher_str = \"\"\"\n",
    "    // Set the is_job_title to false\n",
    "    MATCH (np:NavigableParents {navigable_parent: $navigable_parent})\n",
    "    SET np.is_job_title = false\n",
    "    \"\"\" + cu.return_everything_str + ';'\n",
    "        print(cypher_str.replace('$navigable_parent', f'\"{child_str}\"'))\n",
    "        return [dict(record.items()) for record in tx.run(query=cypher_str, parameters={'navigable_parent': navigable_parent})]\n",
    "    with cu.driver.session() as session:\n",
    "        row_objs_list = session.write_transaction(do_cypher_tx, navigable_parent=child_str)\n",
    "    # display(DataFrame(row_objs_list).T)\n",
    "    # break"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "198e4805-cd59-4d1d-a64e-e75a06515def",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>nodeType</th>\n",
       "      <th>propertyName</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>HeaderTags</td>\n",
       "      <td>is_in_document_structure_elements_set</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>HeaderTags</td>\n",
       "      <td>is_in_document_head_elements_set</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>HeaderTags</td>\n",
       "      <td>is_in_document_body_elements_set</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>HeaderTags</td>\n",
       "      <td>is_in_block_elements_set</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>HeaderTags</td>\n",
       "      <td>is_in_other_block_elements_set</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>94</th>\n",
       "      <td>PartsOfSpeech</td>\n",
       "      <td>is_corporate_scope</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>95</th>\n",
       "      <td>PartsOfSpeech</td>\n",
       "      <td>is_posting_date</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>96</th>\n",
       "      <td>PartsOfSpeech</td>\n",
       "      <td>is_other</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>97</th>\n",
       "      <td>PartsOfSpeech</td>\n",
       "      <td>pos_symbol</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>98</th>\n",
       "      <td>PartsOfSpeech</td>\n",
       "      <td>pos_explanation</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>99 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "         nodeType                           propertyName\n",
       "0      HeaderTags  is_in_document_structure_elements_set\n",
       "1      HeaderTags       is_in_document_head_elements_set\n",
       "2      HeaderTags       is_in_document_body_elements_set\n",
       "3      HeaderTags               is_in_block_elements_set\n",
       "4      HeaderTags         is_in_other_block_elements_set\n",
       "..            ...                                    ...\n",
       "94  PartsOfSpeech                     is_corporate_scope\n",
       "95  PartsOfSpeech                        is_posting_date\n",
       "96  PartsOfSpeech                               is_other\n",
       "97  PartsOfSpeech                             pos_symbol\n",
       "98  PartsOfSpeech                        pos_explanation\n",
       "\n",
       "[99 rows x 2 columns]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "\n",
    "cypher_str = \"\"\"\n",
    "// Get all distinct node types and property names\n",
    "CALL db.schema.nodeTypeProperties() YIELD nodeType, propertyName\n",
    "RETURN DISTINCT nodeType, propertyName;\"\"\"\n",
    "row_objs_list = []\n",
    "with cu.driver.session() as session: row_objs_list = session.write_transaction(cu.do_cypher_tx, cypher_str)\n",
    "if row_objs_list:\n",
    "    df = DataFrame(row_objs_list)\n",
    "    df.nodeType = df.nodeType.map(lambda x: re.sub('[^A-Za-z]+', '', str(x)))\n",
    "    display(df)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "d17d748e-d5f9-4b8b-8891-51e3b2099aca",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>nodeType</th>\n",
       "      <th>propertyName</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>43</th>\n",
       "      <td>FileNames</td>\n",
       "      <td>job_requisition_number</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>69</th>\n",
       "      <td>NavigableParents</td>\n",
       "      <td>is_job_title</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>71</th>\n",
       "      <td>NavigableParents</td>\n",
       "      <td>is_job_duration</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>88</th>\n",
       "      <td>PartsOfSpeech</td>\n",
       "      <td>is_job_title</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>90</th>\n",
       "      <td>PartsOfSpeech</td>\n",
       "      <td>is_job_duration</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "            nodeType            propertyName\n",
       "43         FileNames  job_requisition_number\n",
       "69  NavigableParents            is_job_title\n",
       "71  NavigableParents         is_job_duration\n",
       "88     PartsOfSpeech            is_job_title\n",
       "90     PartsOfSpeech         is_job_duration"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\n",
    "mask_series = df.propertyName.map(lambda x: 'job' in str(x))\n",
    "df[mask_series]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "e068fa17-f159-48ce-a743-8bdc5e8b361c",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>nodeType</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>:`NavigableParents`</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>:`PartsOfSpeech`</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "              nodeType\n",
       "0  :`NavigableParents`\n",
       "1     :`PartsOfSpeech`"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "\n",
    "cypher_str = \"\"\"\n",
    "// Get all node types that have the is_job_title property defined\n",
    "CALL db.schema.nodeTypeProperties() YIELD nodeType, propertyName\n",
    "WHERE propertyName = \"is_job_title\"\n",
    "RETURN DISTINCT nodeType;\"\"\"\n",
    "row_objs_list = []\n",
    "with cu.driver.session() as session: row_objs_list = session.write_transaction(cu.do_cypher_tx, cypher_str)\n",
    "if row_objs_list:\n",
    "    df = DataFrame(row_objs_list)\n",
    "    display(df)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 108,
   "id": "5aae29e5-6fc1-45c3-90cb-e6b0ad7b2c19",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>navigable_parent</th>\n",
       "      <th>is_header</th>\n",
       "      <th>char_count</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Senior Consultant</td>\n",
       "      <td>False</td>\n",
       "      <td>17</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Backend Developers</td>\n",
       "      <td>False</td>\n",
       "      <td>18</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Title:Data Scientist</td>\n",
       "      <td>False</td>\n",
       "      <td>20</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>&lt;b&gt;SQL Developer&lt;/b&gt;</td>\n",
       "      <td>False</td>\n",
       "      <td>20</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Python Web Developer</td>\n",
       "      <td>False</td>\n",
       "      <td>20</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6608</th>\n",
       "      <td>&lt;span style=\"font-family: 'Verdana',sans-serif...</td>\n",
       "      <td>False</td>\n",
       "      <td>97</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6609</th>\n",
       "      <td>&lt;strong&gt;Data Scientist / Machine Learning Scie...</td>\n",
       "      <td>False</td>\n",
       "      <td>100</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6610</th>\n",
       "      <td>Security Data Science Consultant with Artifici...</td>\n",
       "      <td>False</td>\n",
       "      <td>103</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6611</th>\n",
       "      <td>&lt;h2 class=\"jobsearch-JobDescriptionSection-tit...</td>\n",
       "      <td>False</td>\n",
       "      <td>117</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6612</th>\n",
       "      <td>&lt;h2 style=\"font-family:'Helvetica Neue',Helvet...</td>\n",
       "      <td>False</td>\n",
       "      <td>198</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>6613 rows × 3 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                       navigable_parent  is_header  char_count\n",
       "0                                     Senior Consultant      False          17\n",
       "1                                    Backend Developers      False          18\n",
       "2                                  Title:Data Scientist      False          20\n",
       "3                                  <b>SQL Developer</b>      False          20\n",
       "4                                  Python Web Developer      False          20\n",
       "...                                                 ...        ...         ...\n",
       "6608  <span style=\"font-family: 'Verdana',sans-serif...      False          97\n",
       "6609  <strong>Data Scientist / Machine Learning Scie...      False         100\n",
       "6610  Security Data Science Consultant with Artifici...      False         103\n",
       "6611  <h2 class=\"jobsearch-JobDescriptionSection-tit...      False         117\n",
       "6612  <h2 style=\"font-family:'Helvetica Neue',Helvet...      False         198\n",
       "\n",
       "[6613 rows x 3 columns]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "\n",
    "cypher_str = \"\"\"\n",
    "    // Get all the HTML strings that are considered job titles\n",
    "    MATCH (np:NavigableParents)\n",
    "    WHERE\n",
    "        (np.is_job_title = true)\n",
    "        AND (np.is_header = false)\n",
    "    RETURN\n",
    "        np.is_corporate_scope AS is_corporate_scope,\n",
    "        np.is_educational_requirement AS is_educational_requirement,\n",
    "        np.is_header AS is_header,\n",
    "        np.is_interview_procedure AS is_interview_procedure,\n",
    "        np.is_job_duration AS is_job_duration,\n",
    "        np.is_job_title AS is_job_title,\n",
    "        np.is_legal_notification AS is_legal_notification,\n",
    "        np.is_minimum_qualification AS is_minimum_qualification,\n",
    "        np.is_office_location AS is_office_location,\n",
    "        np.is_other AS is_other,\n",
    "        np.is_posting_date AS is_posting_date,\n",
    "        np.is_preferred_qualification AS is_preferred_qualification,\n",
    "        np.is_supplemental_pay AS is_supplemental_pay,\n",
    "        np.is_task_scope AS is_task_scope,\n",
    "        np.navigable_parent AS navigable_parent\n",
    "    ORDER BY size(np.navigable_parent) ASC;\"\"\"\n",
    "row_objs_list = []\n",
    "with cu.driver.session() as session:\n",
    "        row_objs_list = session.write_transaction(cu.do_cypher_tx, cypher_str)\n",
    "if row_objs_list:\n",
    "    df = DataFrame(row_objs_list)\n",
    "    df['char_count'] = df.navigable_parent.map(lambda x: len(str(x)))\n",
    "    columns_list = ['navigable_parent', 'is_header', 'char_count']\n",
    "    display(df[columns_list].sort_values('char_count'))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 105,
   "id": "fb882e30-a967-4e99-8c84-2ddfdf7bc016",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "    // Set the is_job_title to false\n",
      "    MATCH (np:NavigableParents {navigable_parent: \"positions within the Census Bureau in the same geographical location with the same qualifications and specialized experience.\"})\n",
      "    SET np.is_job_title = false\n",
      "    RETURN\n",
      "        np.navigable_parent AS navigable_parent,\n",
      "        np.is_header AS is_header,\n",
      "        np.is_task_scope AS is_task_scope,\n",
      "        np.is_minimum_qualification AS is_minimum_qualification,\n",
      "        np.is_preferred_qualification AS is_preferred_qualification,\n",
      "        np.is_legal_notification AS is_legal_notification,\n",
      "        np.is_job_title AS is_job_title,\n",
      "        np.is_office_location AS is_office_location,\n",
      "        np.is_job_duration AS is_job_duration,\n",
      "        np.is_supplemental_pay AS is_supplemental_pay,\n",
      "        np.is_educational_requirement AS is_educational_requirement,\n",
      "        np.is_interview_procedure AS is_interview_procedure,\n",
      "        np.is_corporate_scope AS is_corporate_scope,\n",
      "        np.is_posting_date AS is_posting_date,\n",
      "        np.is_other AS is_other;\n"
     ]
    }
   ],
   "source": [
    "\n",
    "# mask_series = (df.char_count > 165)\n",
    "for child_str in df.iloc[9939:9940].navigable_parent:\n",
    "    def do_cypher_tx(tx, navigable_parent):\n",
    "        cypher_str = \"\"\"\n",
    "    // Set the is_job_title to false\n",
    "    MATCH (np:NavigableParents {navigable_parent: $navigable_parent})\n",
    "    SET np.is_job_title = false\n",
    "    \"\"\" + cu.return_everything_str + ';'\n",
    "        print(cypher_str.replace('$navigable_parent', f'\"{child_str}\"'))\n",
    "        return [dict(record.items()) for record in tx.run(query=cypher_str, parameters={'navigable_parent': navigable_parent})]\n",
    "    with cu.driver.session() as session:\n",
    "        row_objs_list = session.write_transaction(do_cypher_tx, navigable_parent=child_str)\n",
    "    # display(DataFrame(row_objs_list).T)\n",
    "    # break"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 109,
   "id": "70f534ae-629f-4121-9da2-1078c8f82be0",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>0</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>navigable_parent</th>\n",
       "      <td>&lt;h2 style=\"font-family:'Helvetica Neue',Helvet...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>is_header</th>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>is_task_scope</th>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>is_minimum_qualification</th>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>is_preferred_qualification</th>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>is_legal_notification</th>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>is_job_title</th>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>is_office_location</th>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>is_job_duration</th>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>is_supplemental_pay</th>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>is_educational_requirement</th>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>is_interview_procedure</th>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>is_corporate_scope</th>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>is_posting_date</th>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>is_other</th>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                                            0\n",
       "navigable_parent            <h2 style=\"font-family:'Helvetica Neue',Helvet...\n",
       "is_header                                                               False\n",
       "is_task_scope                                                           False\n",
       "is_minimum_qualification                                                False\n",
       "is_preferred_qualification                                              False\n",
       "is_legal_notification                                                   False\n",
       "is_job_title                                                             True\n",
       "is_office_location                                                      False\n",
       "is_job_duration                                                         False\n",
       "is_supplemental_pay                                                     False\n",
       "is_educational_requirement                                              False\n",
       "is_interview_procedure                                                  False\n",
       "is_corporate_scope                                                      False\n",
       "is_posting_date                                                         False\n",
       "is_other                                                                False"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "\n",
    "cypher_str = \"\"\"\n",
    "    // Set the is_job_title to false\n",
    "    MATCH (np:NavigableParents)\n",
    "    WHERE np.navigable_parent CONTAINS \"Sr. NLP Researcher\"\n",
    "    SET np.is_job_title = true\n",
    "    RETURN\n",
    "        np.navigable_parent AS navigable_parent,\n",
    "        np.is_header AS is_header,\n",
    "        np.is_task_scope AS is_task_scope,\n",
    "        np.is_minimum_qualification AS is_minimum_qualification,\n",
    "        np.is_preferred_qualification AS is_preferred_qualification,\n",
    "        np.is_legal_notification AS is_legal_notification,\n",
    "        np.is_job_title AS is_job_title,\n",
    "        np.is_office_location AS is_office_location,\n",
    "        np.is_job_duration AS is_job_duration,\n",
    "        np.is_supplemental_pay AS is_supplemental_pay,\n",
    "        np.is_educational_requirement AS is_educational_requirement,\n",
    "        np.is_interview_procedure AS is_interview_procedure,\n",
    "        np.is_corporate_scope AS is_corporate_scope,\n",
    "        np.is_posting_date AS is_posting_date,\n",
    "        np.is_other AS is_other;\"\"\"\n",
    "row_objs_list = []\n",
    "with cu.driver.session() as session: row_objs_list = session.write_transaction(cu.do_cypher_tx, cypher_str)\n",
    "if row_objs_list:\n",
    "    df = DataFrame(row_objs_list)\n",
    "    display(df.T)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 112,
   "id": "c01bb085-c361-4841-a64c-8a10672f2516",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>nodeType</th>\n",
       "      <th>propertyName</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td></td>\n",
       "      <td>file_name</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td></td>\n",
       "      <td>file_name_id</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>:`FileNames`</td>\n",
       "      <td>file_name</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>:`FileNames`</td>\n",
       "      <td>file_name_id</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "       nodeType  propertyName\n",
       "0                   file_name\n",
       "1                file_name_id\n",
       "2  :`FileNames`     file_name\n",
       "3  :`FileNames`  file_name_id"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "\n",
    "cypher_str = \"\"\"\n",
    "// Get all node types that have a file property defined\n",
    "CALL db.schema.nodeTypeProperties() YIELD nodeType, propertyName\n",
    "WHERE propertyName CONTAINS \"file\"\n",
    "RETURN DISTINCT nodeType, propertyName;\"\"\"\n",
    "row_objs_list = []\n",
    "with cu.driver.session() as session:\n",
    "        row_objs_list = session.write_transaction(cu.do_cypher_tx, cypher_str)\n",
    "if row_objs_list:\n",
    "    df = DataFrame(row_objs_list)\n",
    "    display(df)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "526b24bf-9446-4a1a-b76a-74741fef73b7",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Job Hunting (Python 3.10.9)",
   "language": "python",
   "name": "jh_env"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.9"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
